        IDENTIFICATION DIVISION.
        PROGRAM-ID. EM03EX07.
        AUTHOR. VINICIUS ALVES.
        INSTALLATION. FATEC-SP.
        DATE-WRITTEN. 23/11/2020.
        DATE-COMPILED.
        SECURITY. ONLY AUTHOR MAY MODIFY.
      * REMARKS.

        ENVIRONMENT DIVISION.
        CONFIGURATION SECTION.
            SOURCE-COMPUTER. IBM-PC.
            OBJECT-COMPUTER. IBM-PC.
            SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.

        INPUT-OUTPUT SECTION.
        FILE-CONTROL.
            SELECT CADALU ASSIGN TO DISK
            ORGANIZATION IS LINE SEQUENTIAL.
            SELECT TRAB   ASSIGN TO DISK.
            SELECT RELALU ASSIGN TO DISK.
        
        FD CADALU
           LABEL RECORD IS STANDARD
           VALUE OF FILE-ID IS "CADALU.DAT".
        01 REGALU.
           02 TURMA-ENT PIC 9(03).
           02 COD-ENT   PIC 9(07).
           02 NOME-ENT  PIC X(30).
           02 NOTAS-ENT.
              03 NOTA1-ENT PIC 99V99.
              03 NOTA2-ENT PIC 99V99.
              03 NOTA3-ENT PIC 99V99.
              03 NOTA4-ENT PIC 99V99.

        SD TRAB.
        01 REGTRAB.
           02 TURMA-TRAB PIC 9(03).
           02 COD-TRAB   PIC 9(07).
           02 NOME-TRAB  PIC X(30).
           02 NOTAS-TRAB.
              03 NOTA1-TRAB PIC 99V99.
              03 NOTA2-TRAB PIC 99V99.
              03 NOTA3-TRAB PIC 99V99.
              03 NOTA4-TRAB PIC 99V99.

        FD RELALU
           LABEL RECORD IS OMITTED.
        01 RELREG PIC X(80).

        WORKING-STORAGE SECTION.
        77 FIM-ARQ PIC XXX VALUE "NAO".

        77 CT-LIN PIC 99 VALUE ZEROES.
        77 CT-PAG PIC 99 VALUE ZEROES.

        77 PREVTURMA PIC 9(03).

        77 MUDOUTURMA PIC XXX VALUE "NAO".

        77 AUXMEDIA      PIC 99V99 VALUE ZEROES.
        77 AUXMEDIAGERAL PIC 99999V99 VALUE ZEROES.
        77 AUXTOTALU PIC 999 VALUE ZEROES.
        77 AUXTOTALUAPR PIC 999 VALUE ZEROES.
        77 AUXTOTALUREP PIC 999 VALUE ZEROES.

        01 CAB-01.
           02 FILLER PIC X(27) VALUE SPACES.
           02 FILLER PIC X(17) VALUE "RELACAO DE ALUNOS".
           02 FILLER PIC X(28) VALUE SPACES.
           02 FILLER PIC X(05) VALUE "PAG. ".
           02 PAG-P  PIC ZZ9 VALUE ZEROES.

        01 CAB-TURMA.
           02 FILLER PIC XX VALUE SPACES.
           02 FILLER PIC X(07) VALUE "TURMA: ".
           02 TURMA-REL PIC 999.

        01 CAB-COLS.
           02 FILLER PIC XX    VALUE SPACES.
           02 FILLER PIC X(06) VALUE "CODIGO".
           02 FILLER PIC X     VALUE SPACES.
           02 FILLER PIC XX    VALUE SPACES.

           02 FILLER PIC XX    VALUE SPACES.
           02 FILLER PIC X(04) VALUE "NOME".
           02 FILLER PIC X(26) VALUE SPACES.
           02 FILLER PIC XX    VALUE SPACES.

           02 FILLER PIC XX    VALUE SPACES.
           02 FILLER PIC X(05) VALUE "MEDIA".
           02 FILLER PIC XX    VALUE SPACES.

        01 DETALHE.
           02 FILLER  PIC XX VALUE SPACES.
           02 COD-REL PIC 999.999.9.
           02 FILLER  PIC XX VALUE SPACES.

           02 FILLER   PIC XX VALUE SPACES.
           02 NOME-REL PIC X(30).
           02 FILLER   PIC XX VALUE SPACES.

           02 FILLER    PIC XX VALUE SPACES.
           02 MEDIA-REL PIC Z9,99.
           02 FILLER    PIC XX VALUE SPACES.

        01 ROD-APR.
           02 FILLER PIC X(49) VALUE SPACES.
           02 FILLER PIC X(28) VALUE "TOTAL DE ALUNOS APROVADOS:  ".
           02 TOT-APR-REL PIC ZZ9.

        01 ROD-REP.
           02 FILLER PIC X(49) VALUE SPACES.
           02 FILLER PIC X(28) VALUE "TOTAL DE ALUNOS REPROVADOS: ".
           02 TOT-REP-REL PIC ZZ9.

        01 ROD-GERAL.
           02 FILLER PIC X(49) VALUE SPACES.
           02 FILLER PIC X(26) VALUE "MEDIA GERAL:              ".
           02 MEDIAGERAL PIC Z9,99.

        01 LIN-SPACES.
           02 FILLER PIC X(80) VALUE SPACES.

        PROCEDURE DIVISION.
        PGM.
            SORT TRAB
                 ASCENDING KEY TURMA-TRAB
                               COD-TRAB
                 USING CADALU
                 OUTPUT PROCEDURE ROTPGM.
        STOP RUN.

        ROTPGM SECTION.
            PERFORM INICIO.
            PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
            PERFORM TERMINO.

        INICIO SECTION.
            OPEN OUTPUT RELALU.
            PERFORM LEITURA.

        LEITURA SECTION.
            RETURN TRAB AT END MOVE "SIM" TO FIM-ARQ.

        PRINCIPAL SECTION.
            PERFORM IMPRESSAO.
            PERFORM LEITURA.

        IMPRESSAO SECTION.
            IF CT-LIN GREATER THAN 39 PERFORM CABECALHO.

            PERFORM VERIFICATURMA.

            IF MUDOUTURMA EQUAL "SIM"
                PERFORM IMPRODTURMA
                PERFORM CABECALHO
            END-IF.

            PERFORM IMPDET.

        VERIFICATURMA.
            MOVE "NAO" TO MUDOUTURMA.
            IF PREVTURMA IS NOT EQUAL TURMA-TRAB
               MOVE "SIM" TO MUDOUTURMA
               MOVE TURMA-TRAB TO PREVTURMA
            END-IF.

        IMPDET SECTION.
            MOVE COD-TRAB TO COD-REL.
            MOVE NOME-TRAB TO NOME-REL.
            ADD NOTA1-TRAB
                NOTA2-TRAB
                NOTA3-TRAB
                NOTA4-TRAB GIVING AUXMEDIA.
            DIVIDE 4 INTO AUXMEDIA GIVING AUXMEDIA MEDIA-REL.
            ADD AUXMEDIA TO AUXMEDIAGERAL.
            ADD 1 TO CT-LIN.
            ADD 1 TO AUXTOTALU.
            IF AUXMEDIA NOT GREATER THAN 7
               ADD 1 TO AUXTOTALUREP
            ELSE
               ADD 1 TO AUXTOTALUAPR
            END-IF.
            WRITE RELREG FROM DETALHE AFTER ADVANCING 1 LINE.

        CABECALHO SECTION.
            MOVE ZEROES TO CT-LIN.
            ADD 1 TO CT-PAG.
            MOVE CT-PAG TO PAG-P.
            MOVE TURMA-TRAB TO TURMA-REL.

            WRITE RELREG AFTER ADVANCING PAGE.
            WRITE RELREG FROM LIN-SPACES AFTER ADVANCING 1 LINE.
            WRITE RELREG FROM CAB-01    AFTER ADVANCING 1 LINE.
            WRITE RELREG FROM CAB-TURMA AFTER ADVANCING 2 LINES.
            WRITE RELREG FROM CAB-COLS  AFTER ADVANCING 2 LINES.

        IMPRODTURMA SECTION.

            IF AUXTOTALU EQUAL ZEROES THEN EXIT SECTION.

            DIVIDE AUXTOTALU INTO AUXMEDIAGERAL GIVING MEDIAGERAL.
            MOVE AUXTOTALUAPR TO TOT-APR-REL.
            MOVE AUXTOTALUREP TO TOT-REP-REL.

            DISPLAY "NEDIAGERAL: " AUXMEDIAGERAL " / " AUXTOTALU

            WRITE RELREG FROM ROD-APR   AFTER ADVANCING 2 LINES.
            WRITE RELREG FROM ROD-REP   AFTER ADVANCING 1 LINE.
            WRITE RELREG FROM ROD-GERAL AFTER ADVANCING 1 LINE.
            WRITE RELREG FROM LIN-SPACES AFTER ADVANCING 1 LINE.

            MOVE ZEROES TO AUXMEDIAGERAL.
            MOVE ZEROES TO AUXTOTALU.
            MOVE ZEROES TO AUXTOTALUAPR.
            MOVE ZEROES TO AUXTOTALUREP.

        TERMINO SECTION.
            PERFORM IMPRODTURMA.
            CLOSE RELALU.