        IDENTIFICATION DIVISION.
        PROGRAM-ID.    EM01EX06.
        AUTHOR.        VINICIUS ALVES.
        INSTALLATION.  FATEC-SP.
        DATE-WRITTEN.  21/11/2020.
        DATE-COMPILED. 21/11/2020.
      * REMARKS. LÊ OS DADOS DOS FUNCIONÁRIOS EM CADENT.DAT E GRAVA EM
      * CADSAI.DAT SOMENTE OS FUNCIONÁRIOS COM SALÁRIO BRUTO MAIOR QUE
      * R$ 3.000,00.

        ENVIRONMENT DIVISION.
            CONFIGURATION SECTION.
            SOURCE-COMPUTER. IBM-PC.
            OBJECT-COMPUTER. IBM-PC.
            SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.

            INPUT-OUTPUT SECTION.
            FILE-CONTROL.
            SELECT CADENT ASSIGN TO DISK
            ORGANIZATION IS LINE SEQUENTIAL.
            SELECT CADSAI ASSIGN TO DISK
            ORGANIZATION IS LINE SEQUENTIAL.

        DATA DIVISION.
            FILE SECTION.

            FD CADENT
               LABEL RECORD IS STANDARD
               VALUE OF FILE-ID IS "CADENT.DAT".
            01 REGENT.
               02 MAT-ENT  PIC 9(05).
               02 NOME-ENT PIC X(30).
               02 SAL-ENT  PIC 9(05)V99.

            FD CADSAI
               LABEL RECORD IS STANDARD
               VALUE OF FILE-ID IS "CADSAI.DAT".
            01 REGSAI.
               02 MAT-SAI   PIC 9(05).
               02 NOME-SAI  PIC X(20).
               02 SAL-SAI  PIC 9(05)V99.

            WORKING-STORAGE SECTION.
            77 FIM-ARQ PIC X(03) VALUE "NAO".
        
        PROCEDURE DIVISION.
        PGM.
            PERFORM INICIO.
            PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
            PERFORM TERMINO.
        STOP RUN.

        INICIO.
            OPEN INPUT  CADENT
                 OUTPUT CADSAI.
            PERFORM LEITURA.

        LEITURA.
            READ CADENT AT END MOVE "SIM" TO FIM-ARQ.

        GRAVACAO.
            IF SAL-ENT IS NOT GREATER THAN 3000 THEN EXIT SECTION.
            MOVE MAT-ENT TO MAT-SAI.
            MOVE NOME-ENT TO NOME-SAI.
            MOVE SAL-ENT TO SAL-SAI.
            WRITE REGSAI.

        PRINCIPAL.
            PERFORM GRAVACAO.
            PERFORM LEITURA.

        TERMINO.
            CLOSE CADENT
                  CADSAI.
